app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: 'You have creatad book successfully.'
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "g"], ["body", "gg"], ["created_at", "2020-01-20 12:58:02.650939"], ["updated_at", "2020-01-20 12:58:02.650939"], ["user_id", 1]]
SELECT "books".* FROM "books"

  def ensure_correct_user
    book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]