app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "d07f25c5ed7945ad185a9080946ba537869f29b0c53004f266ce0f7bb0dd"], ["introduction", "qqn"], ["updated_at", "2020-01-20 14:24:25.128722"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def ensure_correct_user
    user = User.find(params[:id])